# Homework Week 5 - Questions
# SQLite, join and merge tables

In [1]:
%matplotlib inline

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

import sqlite3

In [3]:
conn = sqlite3.connect('data_week5/chinook.db')

In [4]:
QUERY = "SELECT * FROM sqlite_master WHERE type = 'table'"
pd.read_sql(QUERY, conn)

,type,name,tbl_name,rootpage,sql
0,table,albums,albums,2,"CREATE TABLE ""albums""\r\n(\r\n [AlbumId] IN..."
1,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
2,table,artists,artists,4,"CREATE TABLE ""artists""\r\n(\r\n [ArtistId] ..."
3,table,customers,customers,5,"CREATE TABLE ""customers""\r\n(\r\n [Customer..."
4,table,employees,employees,8,"CREATE TABLE ""employees""\r\n(\r\n [Employee..."
5,table,genres,genres,10,"CREATE TABLE ""genres""\r\n(\r\n [GenreId] IN..."
6,table,invoices,invoices,11,"CREATE TABLE ""invoices""\r\n(\r\n [InvoiceId..."
7,table,invoice_items,invoice_items,13,"CREATE TABLE ""invoice_items""\r\n(\r\n [Invo..."
8,table,media_types,media_types,15,"CREATE TABLE ""media_types""\r\n(\r\n [MediaT..."
9,table,playlists,playlists,16,"CREATE TABLE ""playlists""\r\n(\r\n [Playlist..."
10,table,playlist_track,playlist_track,17,"CREATE TABLE ""playlist_track""\r\n(\r\n [Pla..."
11,table,tracks,tracks,20,"CREATE TABLE ""tracks""\r\n(\r\n [TrackId] IN..."
12,table,sqlite_stat1,sqlite_stat1,864,"CREATE TABLE sqlite_stat1(tbl,idx,stat)"

In [ ]:
# Q1 : save the artists, albums and tracks tables in three different dataframes with clear names

In [ ]:
#Q2: Join artists and albums tables in two ways, using a SQL statement in pandas for one
# and using a pandas function to join dataframes for the second way.

In [ ]:
#Q3: Create a PivotTable showing for each artist, his/her/their albums (the titles), and for each album the duration 
# 2 levels expected in the hierarchical index.

#Hint : Use the table tracks and the df created in Q2.

In [ ]:
#Q4: Plot a decreasing bar char showing the top 20 albums by duration

In [ ]:
# Q5: Create an UNpivoted dataFrame with as many rows as there are invoice_items.
# For each invoice_item (that is, each InvoiceLineId), the country of the customer and genre of the track 
# are the columns.
# are expected to be columns.
# Make InvoiceLineId the Index.

# Hint: make multiple merging operations using customers, invoices, invoice_items, tracks and genres 
# (yes a repetitive task)
# Use the argument suffixes of the function pd.DataFrame.merge for overlapping column names

pd.DataFrame.merge documentation

http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html

In [ ]:
#Q6: Select only  CustomerId and email from customers table using pd.read_sql_query()

In [ ]:
#Q7: Select only  CustomerId and email from customers table  with country = USA using pd.read_sql_query()

In [ ]:
#Q8: Select CustomerId, Total from invoices with the ten most important totals

In [ ]:
#Q9: Merge the two dataframes created in Q7 and Q8 by CustomerId
# Study the different way of merging : inner, left and right